{"status":"success","totalResults":141,"results":[{"title":"'We're afraid to shower': Fear and anxiety linger in Ohio town reeling from toxic train derailment","link":"https://www.nbcnews.com/news/us-news/re-afraid-shower-fear-anxiety-linger-ohio-town-reeling-toxic-train-der-rcna71686","keywords":null,"creator":["Kenzi Abou-Sabe"],"video_url":null,"description":"More than two weeks after the train derailment, many in East Palestine said they remain gripped by fear and anxiety despite assurances air and drinking water are safe.","content":"EAST PALESTINE, Ohio — Doug Brayshaw was sitting on his porch when a massive plume of black smoke rose over the site of the Norfolk Southern train derailment like a scene out of a horror movie. “It was like a storm, like a big storm was coming,” said Brayshaw, a truck driver who lives less than 3 miles from the site where Norfolk Southern chose to burn hazardous chemicals to avoid the risk of an explosion. Since then, Brayshaw, 63, has fretted over whether his well water is safe. Some 15 days passed before officials finally arrived at his home Tuesday to test it, but he is going to have to wait even longer before he gets any answers. He said he was told it could take up to 10 days for the results to come back. “We’re afraid to shower,” said Brayshaw, who has been cooking with bottled water he picks up from an assistance center the rail company set up at a local church. “I won’t even give my dog drinking water out of my well right now because I’m worried.” East Palestine residents have been on edge since the Feb. 3 derailment of a 150-car Norfolk Southern train. The company initiated the controlled burn of vinyl chloride from five rail cars on Feb. 6. More than two weeks later, many East Palestine residents said they remain gripped by fear and anxiety despite assurances by government officials that the air and drinking water are safe. Mothers have turned to social media in a desperate attempt to crowdsource tips on how to safeguard their homes. Some have described wiping everything in their homes down with dish soap, throwing out food that was open and hunting online for the best air purifiers, even though they know such measures might be futile. “Mentally, I’m exhausted,” said Ashley Floor, 31, one of the women who have documented their struggles on a Facebook group for East Palestine residents. In some cases, assistance provided by Norfolk Southern has raised more questions for residents. The company says it has distributed more than 100 air purifiers to residents but, according to experts, common consumer air purifiers are ineffective against compounds like vinyl chloride. Jenna Catone, 31, lived in a hotel for 10 days until Norfolk Southern confirmed that her home’s air had been tested. When a local company announced it had “acquired the home cleanup contract from Norfolk Southern” for residents who lived within the evacuation zone, she jumped at the chance and signed up for what she thought was going to be a home cleanup. What she got was a “fogging.” She said a man from the cleaning company knocked on the door, didn’t take his shoes off and then proceeded to spray down her home with a disinfectant and odor neutralizer. “They didn’t even bring a rag in with them,” she said. Norfolk Southern didn’t respond directly to questions about residents’ ongoing concerns. But the company noted that it launched a website Monday, NSMakingItRight.com , that provides regular updates to the community. “If there’s something that we haven’t addressed, we want to hear from residents so we can provide them with the up-to-date information,” a Norfolk Southern representative said. The EPA on Tuesday ordered Norfolk Southern to clean up any contaminated soil and water, and pay all the costs. The agency said the company must also reimburse it for the costs of cleaning homes and conducting weekly municipal water tests. “I’d like to see things going faster,” EPA Administrator Michael Regan said in an interview with NBC News. “And I’d like to see things more transparent and that’s why we’re taking this action.” So far, the EPA and Norfolk Southern have tested air quality in 533 homes and sampled the municipal water supply and deemed them safe. Testing results for homes that rely on private well water has not come back yet, though 52 have been sampled so far. Catone said her experience trying to get hotel and evacuation expenses reimbursed has only added to her already high stress levels. On one trip to the Norfolk Southern assistance center, she waited five hours. Another trip lasted four hours. “I went two times to get money back during that time and still need to go to get the rest of my expenses back, but the center is flooded with people just trying to get that $1,000,” Catone said, referring to the “inconvenience check” Norfolk Southern is offering to area residents. “I am sitting on about $1,500 in receipts I need refunds for,” she added. High levels of anxiety can compound any adverse physical health effects, experts say. Dr. Maureen Lichtveld, an epidemiologist, spent 18 years working for the Centers for Disease Control and Prevention and the Department of Health and Human Services responding to environmental impacts in the wake of disasters such as Hurricane Katrina and the Deepwater Horizon oil spill. After Katrina, she and her colleagues studied how mold in homes affects asthma in children. “We found that yes, the spores of the mold exposure indoors had the potential to increase asthma attacks in those kids,” said Lichtveld, who is the dean of the University of Pittsburgh School of Public Health. “But what was right next to that was having lost a pet during the hurricane, and having moved schools more than twice in a year.” She said she thinks such measures as offering alternative accommodations for affected residents, regardless of whether or not their homes have been deemed safe, would go a long way in allaying their fears. “Perception is reality,” Lichtveld said. “Recognizing and respecting the community’s decision — or a person’s decision — not to go back, regardless how clean the room is, is the responsibility of us as scientists.” Steve Montgomery, 51 a local farmer, is worried about how the contamination will affect his operation. “Our sales are down today,” said Montgomery, who runs Lamppost Farm, an organic farm and educational facility in nearby Columbiana. “Is that because everybody’s afraid? I don’t know.” Montgomery said he remains optimistic that his farm will survive the crisis, but he’s joining a lawsuit against the railroad company just in case. “Say we lose 25% of our customers, that’s a huge hit,” he said. Floor and her husband have talked about moving away but feel too tied to the community. She’s now worried about a painful, itchy rash that has spread across her 12-year-old son’s body. “It’s hard for me to decide if it’s because of something in the air that’s bothering him, or the water when he gets a shower, or his clothes that’s being washed in this water, or if it’s something else,” she said. Floor said she’s glad that officials have committed to testing the municipal water on a weekly basis, but she worries that the efforts will fade over time. “It’s going to take years for our water to be affected,” she said. “And by that time, I feel like everybody’s going to be gone, and nobody’s going to be testing it.”","pubDate":"2023-02-22 17:35:40","image_url":"https://media-cldnry.s-nbcnews.com/image/upload/rockcms/2023-02/230217-east-palestine-ohio-train-derailment-evacuation-se-514p-cde07e.jpg","source_id":"nbcnews","category":["top"],"country":["united states of america"],"language":"english"},{"title":"Olga's Kitchen has new partnership with McClure's Pickles","link":"http://rssfeeds.freep.com/~/728241011/0/freep/entertainment~Olgas-Kitchen-has-new-partnership-with-McClures-Pickles/","keywords":null,"creator":["Susan Selasky"," Detroit Free Press"],"video_url":null,"description":"Michigan brand Olga's Kitchen announced a new partnership with McClure's Pickles, another local favorite to provide product on several sandwiches.       ","content":"Olga's Kitchen , a hometown Michigan brand for more than 50 years, has a new partnership with McClure's Pickles , another local favorite. The two have teamed up by pairing several of Olga's signature sandwiches with McClure's pickles. On Tuesday, Olga's Kitchen announced the Shrimp Po'Boy Olgas as a new seafood option just in time for the Lenten season. The sandwich is wrapped in Olga's signature (and secret) bread and features crispy shrimp and McClure's sweet and spicy pickles. Available for a limited time, the Shrimp Po'Boy ($9.99) is also topped with lettuce, vine-ripened tomatoes and spicy sriracha aioli. “At Olga’s Kitchen, we honor our rich history of more than 50 years by continuing to innovate new menu items and explore new flavors for our fans to enjoy,” said Tom Ruddy, director of culinary and purchasing at Olga's Kitchen in a news release. “McClure’s shares Olga’s deep Detroit roots, so we’re thrilled to partner with them to introduce our new Shrimp Po’Boy. ” More: Birmingham's Tallulah Wine Bar and Bistro is 2023 Restaurant of the Year Classic — Readers' Choice More: Detroit's PizzaPlex announces plans to close after nearly 7 years At Olga's Kitchen, McClure's Pickles are also served on its returning Angus Steakburger Olga and Middle Eastern spiced chicken shawarma. \"Collaborating with Olga’s Kitchen to evolve their menu is incredibly meaningful to us at McClure’s,” said Joe McClure, co-founder of McClure’s, in a news release. “As two local powerhouse brands, this partnership ensures our shared community has the freshest, most flavorful pickles in their Olgas and gives more consumers the chance to taste our family recipe. We know we’ve made something great together.” More: Nuts deliver heart health benefits that are always worth celebrating McClure's Pickles got its start in 2006 when brothers Bob and Joe McClure took their great-grandmother's pickle recipe and started making and selling jars of pickles. Since then, they've expanded the line, producing a variety of pickles, Bloody Mary mix, relish and sauerkraut. Olga's was founded by the late Olga Loizon and is known for its signature Olga bread. The chain operates 24 Olga’s Kitchen and Olga’s Fresh Grille restaurants. More: Olga's Kitchen founder Olga Loizon dies at 92 In Michigan, Olga's has more than 20 locations. In honor of the new partnership, Olga's Kitchen and McClure's are hosting a pop-up 5-8 p.m. Friday at Atwater Brewery, 237 Jos Campau, Detroit. At the event, which is open to the public, they will be serving Louisiana seafood, according to a news release. Contact Detroit Free Press food writer Susan Selasky and send food and restaurant news to: sselasky@freepress.com. Follow @SusanMariecooks on Twitter. Support local journalism and become a digital subscriber to the Free Press .","pubDate":"2023-02-22 15:32:09","image_url":"https://www.gannett-cdn.com/presto/2023/02/21/PDTF/c8fe6590-faba-42cf-8dab-69cdd60f2354-PoBoy_Social_2_1.jpg","source_id":"freep","category":["entertainment"],"country":["united states of america"],"language":"english"},{"title":"Lawsuit alleges SNAP 'skimming' victims couldn't be reimbursed, violating federal law","link":"https://www.nbcnews.com/news/us-news/lawsuit-behalf-snap-skimming-victims-alleges-usda-policy-violates-fede-rcna70089","keywords":null,"creator":["Elizabeth Chuck"],"video_url":null,"description":"A lawsuit on behalf of SNAP “skimming” victims who haven’t been reimbursed alleges the USDA s under regulations that violate federal law.","content":"A lawsuit on behalf of New York state residents who were electronically robbed of the funds they use for groceries seeks to have the victims reimbursed by the U.S. Agriculture Department, alleging that failure to do so is in violation of federal law. The federal lawsuit against the USDA was filed Wednesday morning by the Legal Aid Society, a New York-based nonprofit legal services provider, and law firm Freshfields Bruckhaus Deringer. The class-action suit represents six plaintiffs and intends to represent thousands of other New York state residents who participate in the Supplemental Nutrition Assistance Program, or SNAP, and whose benefits were also skimmed. The complaint claims the limited scenarios under which the USDA currently authorizes states to use federal money to reinstate SNAP benefits are not compliant with a congressional mandate, which says grocery funds stolen before the recipient receives them must be replaced. Skimming is not one of those scenarios. It comes as reports of SNAP skimming have grown nationwide. The theft is done by placing hidden devices on card readers’ keypads to electronically steal account information, often without the victim or store owners knowing. In New York state alone, there have been more than 10,600 incidents of SNAP skimming since January, with victims robbed of more than $4.6 million worth of benefits in total, according to recent data from the state’s Office of Temporary and Disability Assistance. Yet because the federal government does not currently cover the cost of replacement funds, few states have reimbursed the victims . The omnibus bill passed in December provided some help. It included a provision for the replacement of stolen SNAP funds with federal dollars that allows up to two months’ worth of skimmed benefits to be reinstated, but it applies only to victims skimmed from October 2022 through September 2024. Wednesday's complaint argues that those measures do not go far enough and is seeking complete restoration of every New York state resident’s stolen SNAP benefits dating back to January 2022, regardless of the amount stolen. “It’s unconscionable that low-income households already struggling to make ends meet are forced to bear the cost of skimmed food benefits,” Alex MacDougall, staff attorney at the Legal Aid Society , said in an interview. “It quite literally takes away the ability of parents to feed their children.” Typically, thieves place skimming devices on the card-swiping machines by cash registers. The devices are plastic keypad overlays that look nearly identical to the card reader terminals themselves. (See a picture of the skimming overlays here .) “Oftentimes people don’t realize they’ve been stolen from until they’re at the cash register with a cart full of groceries,” said Ashley Burnside, a senior policy analyst at the Center for Law and Social Policy (CLASP), who is not involved in the federal lawsuit. “It’s devastating for people to then realize, after they go through the hoops of calling their SNAP agency reporting the crime, that they don’t have any options for reimbursement.” SNAP benefits, formerly known as food stamps, are issued monthly onto electronic benefits transfer, or EBT, cards. While skimming is not unique to EBT cards, security measures such as contactless payments and embedded microchips have combated it in the credit card industry. No SNAP state agency uses cards with chips, according to the USDA. Before switching to an electronic system, food stamps were issued in paper form, and the USDA would replace them if they got stolen in the mail before participants received them. Current regulations based on a 2010 policy limit states’ ability to replace electronic benefits using federal funds primarily to cases of “household misfortune” — situations when food purchased with EBT funds is destroyed in a fire, for example, or after the physical card itself was reported stolen from a participant. Wednesday morning's lawsuit alleges that because a 1996 mandate declared that stolen electronic transfer SNAP benefits should get replaced in the same manner as stolen paper coupons were, it’s illegal for the USDA to not replace skimmed benefits. In a statement, the USDA said it does not comment on ongoing litigation. The theft of benefits can be disastrous for families who are already financially stretched. A mother who lives in New York public housing and asked not to be identified because she was discussing her personal finances said that since she was skimmed out of more than $2,000 several months ago, she has put rent money toward food instead — and is now behind on rent payments. She was shocked the day she discovered she had been skimmed. “I just broke down. I was crying. My kids were trying to pat me, and I’m like, ‘Oh my goodness, oh my gosh. All of our money is gone,’” she said. Tuesday’s complaint is believed to be the first federal lawsuit regarding SNAP skimming, according to the attorneys. In November, a class-action lawsuit was filed in Massachusetts against the state agency that administers SNAP benefits on behalf of skimming victims in that state. While the federal lawsuit seeks restoration of benefits for New York state skimming victims, it could have implications for the rest of the country, MacDougall said. “Any change in SNAP policy or regulation will obviously impact all SNAP recipients nationwide,” she said. “If we prevail in the case, it’ll set a precedent for similarly situated folks.” The lawsuit comes amid growing calls to strengthen the security of SNAP EBT cards to prevent others from being victimized in the future. Something as simple as text alerts sent to recipients when their card has been used out of state would be a helpful start, Burnside said. “The card is susceptible to theft because it has not been kept up to marketplace protections and recipients are then left vulnerable, but also left with no recourse once their funds are ultimately stolen,” she said. “It is absolutely heartbreaking.”","pubDate":"2023-02-22 14:45:39","image_url":"https://media-cldnry.s-nbcnews.com/image/upload/rockcms/2023-02/230217-snap-skimming-lawsuit-ls-82a16d.jpg","source_id":"nbcnews","category":["top"],"country":["united states of america"],"language":"english"},{"title":"Fat, Sugar, Salt ... You’ve Been Thinking About Food All Wrong","link":"https://www.wired.com/story/ultra-processed-foods/","keywords":["Food and Drink","food science","health","diseases","food","public health"],"creator":["Matt Reynolds"],"video_url":null,"description":"Scientists are asking tough questions about the health effects of ultra-processed diets. The answers are complicated—and surprising.","content":null,"pubDate":"2023-02-22 12:00:00","image_url":"https://media.wired.com/photos/63f557ea1b87b32b35988cb9/master/pass/chickennuggets_science_GettyImages-1202620048.jpg","source_id":"wired","category":["top"],"country":["united states of america"],"language":"english"},{"title":"VeChain builds markets for reclaimed ocean waste plastic to conquer billion-$-market and save mother nature","link":"https://www.crypto-news-flash.com/vechain-builds-markets-for-reclaimed-ocean-waste-plastic-to-conquer-billion-market-and-save-mother-nature/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-builds-markets-for-reclaimed-ocean-waste-plastic-to-conquer-billion-market-and-save-mother-nature","keywords":["News","ReSea","Vechain","VET"],"creator":["John Kumi"],"video_url":null,"description":"VeChain is building a market to assist in reclaiming plastic waste in oceans. The idea is to convert collectors into sponsors to keep the ocean clean while reducing poverty. According to IUCN, 300 million tons of plastics are produced every year for different usages. Out of this, 14 million tonnes of plastics end up in [...] Der Beitrag VeChain builds markets for reclaimed ocean waste plastic to conquer billion-$-market and save mother nature erschien zuerst auf Crypto News Flash.","content":"VeChain is building a market to assist in reclaiming plastic waste in oceans. The idea is to convert collectors into sponsors to keep the ocean clean while reducing poverty. window.coinzilla_display = window.coinzilla_display || []; var c_display_preferences = {}; c_display_preferences.zone = \"277607dd63990fae550\"; c_display_preferences.width = \"728\"; c_display_preferences.height = \"90\"; coinzilla_display.push(c_display_preferences); According to IUCN , 300 million tons of plastics are produced every year for different usages. Out of this, 14 million tonnes of plastics end up in the ocean each year. It is interesting to note that plastics make up 80 percent of all marine debris. Unfortunately, many countries lack the resources to prevent plastic pollution which causes leakages into rivers and oceans, and in the long run affects human health and food. As part of the measures to fight against this situation, VeChain (VET) is building a market to assist in reclaiming plastic waste in oceans. The idea is to convert collectors into sponsors to keep the ocean clean while reducing poverty. #VeChain Technical Roadmap Sustainable Digital Ecosystem Applications #1 : Plastic Traceability & Plastic Neutrality via Plastic Credits. Plastic Credit Ecosystem deliverable by end-Q1 2024 $VET #DigitalEcosystems #Sustainability ♻️🌱🌊 @TheOceanCleanup @ReseaP pic.twitter.com/4R6R3S1bY3 — Splendid.vet Ⓥ (@SplendidMite) February 21, 2023 These circular ecosystems incentivize stakeholders from collectors to sponsors, create 100% transparency and help reduce poverty while cleaning our oceans. VeChain passion to create plastic-free oceans VeChain has been very passionate about this project dating back to 2021 when it announced a partnership with ReSea, and DNV to create a seven-step tracking process to ensure that the journey of the plastic waste from the clean-up area to the waste bank is documented. ReSea is a project that aims “to end the ocean plastic crisis while making waves beyond the sea we work in.” The project was able to recover 672,936 lbs of plastics from the ocean and rivers from January-April, 2021. A blockchain-based system referred to as the ToolChain platform by VeChain plays a huge role in this. Follow us for the latest crypto news! window.coinzilla_display = window.coinzilla_display || []; var c_display_preferences = {}; c_display_preferences.zone = \"229607dd639904ac581\"; c_display_preferences.width = \"300\"; c_display_preferences.height = \"250\"; coinzilla_display.push(c_display_preferences); A blockchain-based tracking system secures real-time data and tracks [sic]the origin of the recovered plastic and all the steps of the cleanup process until delivery at a local waste bank. This ensures true authenticity and the highest level of traceability. The team behind the project believes that donors often trust the words of charities they send their money. In most cases, there is no evidence that their money is being put to good use. This is part of the reasons behind the implementation of the blockchain-based certification process by ReSea. This ensures that a huge system of data collection that is immutable, efficient, and much harder to manipulate is in place. In this case, donors can follow up on every step of the process and be sure that the money is being put to good use. Usages extend to other fields The use cases of VeChain go beyond the campaign to remove oceanic waste. The blockchain assisted Bayer China to come up with Csecure. This is meant to advance transparency and security in the Bayer clinical trial supply chain. Also, VeChain partnered with I-Dante to come up with a blockchain-enabled medical data management platform called The E-NewHealthLife. Vechain expects to develop more solutions for all stakeholders in the future. @import url(\"//fonts.googleapis.com/css?family=Lato:400,700&subset=latin\");@media (min-width:300px){[data-css=\"tve-u-185a09262cb\"]{overflow:hidden;background-color:rgb(58,92,245) !important;border-radius:3px !important;padding:30px !important;--background-color:rgb(58,92,245)!important;--tve-applied-background-color:rgb(58,92,245)!important;}:not(#tve) [data-css=\"tve-u-185a09262cd\"]{font-family:Lato;font-weight:400;color:rgb(255,255,255) !important;font-size:53px !important;text-transform:none !important;}[data-css=\"tve-u-185a09262d0\"]{margin:40px 0px 0px !important;background-image:none !important;--background-image:none!important;--tve-applied-background-image:none!important;padding-bottom:0px !important;}:not(#tve) [data-css=\"tve-u-185a09262d1\"] input,:not(#tve) [data-css=\"tve-u-185a09262d1\"] textarea,:not(#tve) [data-css=\"tve-u-185a09262d1\"] ::placeholder{font-size:var(--tve-font-size,33px);text-align:center;}[data-css=\"tve-u-185a09262d1\"]{--tve-font-size:33px;}[data-css=\"tve-u-185a09262d2\"]{--tcb-local-color-cf6ff:var(--tcb-color-0)!important;--tcb-local-color-73c8d:rgb(225,120,45)!important;min-width:100%;}:not(#tve) [data-css=\"tve-u-185a09262d2\"]:hover .tcb-button-link{background-color:var(--tcb-local-color-73c8d)!important;}[data-css=\"tve-u-185a09262d2\"] .tcb-button-link{background-color:var(--tcb-local-color-cf6ff)!important;letter-spacing:2px;border-radius:5px;padding:18px 30px;}[data-css=\"tve-u-185a09262d2\"] .tcb-button-link span{color:rgb(255,255,255);--tcb-applied-color:#fff;}:not(#tve) [data-css=\"tve-u-185a09262d2\"] .tcb-button-link{line-height:1.2em;font-size:32px;}:not(#tve) [data-css=\"tve-u-185a09262d4\"]{font-size:21px !important;color:rgb(146,136,136) !important;--tcb-applied-color:rgb(146,136,136)!important;--tve-applied-color:rgb(146,136,136)!important;}[data-css=\"tve-u-185a09262d5\"]{color:rgb(255,255,255) !important;}[data-css=\"tve-u-185a0960607\"]{margin-bottom:-45px !important;}}@media (max-width:1023px){[data-css=\"tve-u-185a0960607\"]{margin-bottom:-45px !important;padding-bottom:0px !important;}}@media (max-width:767px){:not(#tve) [data-css=\"tve-u-185a09262cd\"]{font-size:30px !important;}[data-css=\"tve-u-185a09262d0\"]{margin-top:16px !important;}} .tve-leads-conversion-object .thrv_heading h1,.tve-leads-conversion-object .thrv_heading h2,.tve-leads-conversion-object .thrv_heading h3{margin:0;padding:0}.tve-leads-conversion-object .thrv_text_element p,.tve-leads-conversion-object .thrv_text_element h1,.tve-leads-conversion-object .thrv_text_element h2,.tve-leads-conversion-object .thrv_text_element h3{margin:0} Subscribe to our daily newsletter! >> Subscribe << No spam, no lies, only insights. You can unsubscribe at any time. VeChain has been accumulating experience in bridging trust and bringing in transparency into business while being compliant with local authorities and regulators. Given the huge potential of blockchain technology in the medical and healthcare sector, VeChain will continue to develop solutions for all stakeholders and pursue more opportunities in the near future. Crypto News Flash does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to cryptocurrencies. Crypto News Flash is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned. ReSea Vechain VET","pubDate":"2023-02-22 11:45:25","image_url":null,"source_id":"cryptonewsflash","category":["top"],"country":["united states of america"],"language":"english"},{"title":"The United States and New-Zealand Now Roughly Have the Same Interest Rates","link":"https://www.financemagnates.com//thought-leadership/the-united-states-and-new-zealand-now-roughly-have-the-same-interest-rates/","keywords":["Thought Leadership"],"creator":["Finance Magnates Staff","www.financemagnates.com"],"video_url":null,"description":"<p class=\"MsoNormal\">The Reserve Bank of New Zealand, at its Monetary Policy Meeting held today, 22nd February, has voted to increase its Official Cash Rate by 50 basis points to 4.75%. This latest increase marks the tenth consecutive rate hike since August 2021, for a whopping total bump of 450 basis points to try and get inflation back in line with the target around 2%.</p><p class=\"MsoNormal\">Daily Chart NZD/USD from the ActivTrades online trading platform, showing that the pair is losing bullish momentum as the USD is strengthening. </p><p class=\"MsoNormal\">The NZD/USD might be about to validate a double top on its daily chart, leading to potentially more losses.</p><p class=\"MsoNormal text-align-start\">RBNZ pushes rates higher, says the strategy is slowly working</p><p class=\"MsoNormal text-align-start\">It's been a choppy start to the year for the island nation, as new Prime Minister, Chris Hipkins was sworn in late last month after Jacinta Ardern chose to resign from her position after nearly two terms. The RBNZ in its <a href=\"https://www.rbnz.govt.nz/hub/-/media/project/sites/rbnz/files/publications/monetary-policy-statements/2023/mpsfeb23.pdf\" target=\"_blank\" rel=\"follow\">statement</a> also made mention of the devastating cyclone that claimed at least 11 lives and has caused billions of dollars worth of damage in recent weeks.</p><p class=\"MsoNormal\">There's an outside hope that the end of increasing rate hikes may come soon for struggling Kiwis though, as key financial and economic data is beginning to show small signs of the cooling inflation that the central bank has fought tooth and nail to achieve. </p><p class=\"MsoNormal\">Inflation is still holding strong, but has it peaked?</p><p class=\"MsoNormal text-align-start\">In the 12 months leading up to December last year, inflation rose again by 7.2% according to the latest CPI data released by <a href=\"https://www.stats.govt.nz/news/annual-inflation-remains-at-7-2-percent/\" target=\"_blank\" rel=\"follow\">Stats NZ</a>. This rise followed an annual increase of 7.2% in the third quarter, and 7.3% in the quarter before, prompting some economists to forecast that inflation has only room to fall from here.</p><p class=\"MsoNormal\">The largest drivers of inflation in the last measured quarter were housing and household utility costs, with the increasing price of food following shortly after. </p><p class=\"MsoNormal\">Extreme tightness in the labor market also persists, according to the RBNZ, with employment much above its sustainable level. </p><p class=\"MsoNormal\">In the three months ending in December last year, the unemployment rate was still 3.4%, and accelerating wage rises due to worker shortages has helped sustain family earnings, but also contributed to domestic inflation by pushing expenses higher.</p><p class=\"MsoNormal\">Many households are still yet to feel the full impact of rate rises in this tightening cycle so far, as their mortgages have been on short-term fixed low rates. </p><p class=\"MsoNormal\">This year, a large number of these homeowners will come to the end of their fixed term contracts, and this likely will quickly grind their cash reserves and spending to a halt. Demand will fall shortly thereafter and if the strategy of the RBNZ is successful, inflation should dramatically follow suit in the second half of this year.</p><p class=\"MsoNormal text-align-start\"><a href=\"https://www.reuters.com/markets/new-zealand-inflation-remains-high-not-bad-central-bank-expected-2023-01-25/\" target=\"_blank\" rel=\"follow\">According to both the ANZ and Kiwibank,</a> inflation has already reached its peak, and is gradually declining both internationally and domestically. By as early as the end of this year, they predict inflation will have reduced close to that of the RBNZ's 1%-3% target range again.</p><p class=\"MsoNormal\">Housing prices plummeting as mortgages begin to shift to higher borrowing rates</p><p class=\"MsoNormal\">New Zealand's housing market crash is getting more dramatic, according to the Real Estate Institute of New Zealand's (REINZ) <a href=\"https://www.reinz.co.nz/libraryviewer?ResourceID=491\" target=\"_blank\" rel=\"follow\">January housing market findings</a>. </p><p class=\"MsoNormal\">The Index, which accounts for variations in the composition of homes sold from month to month rather than relying on title changes based on sales that may have taken place many months earlier, fell by 0.2% in January, bringing the year-over-year loss to 13.9%.</p><p class=\"MsoNormal\">The number of houses available for sale has risen by 60% or more in more than half of New Zealand's fourteen regions in the last year, which is despite the fact that there has been a decline in new listings of 16% over the same period. </p><p class=\"MsoNormal\">Demand has now well and truly taken a dive in the very recently booming property sector of the economy.</p><p class=\"MsoNormal\">Many new homeowners who bought while the OCR was at historic lows of 0.25% in 2020 and 2021, will soon be having their home loans shift from their low fixed rate to the much higher variable one, which could see them go from 2 or 3% to up to 7% borrowing rates. </p><p class=\"MsoNormal text-align-start\">It's a similar story to Australia, whereby a ‘<a href=\"https://www.afr.com/markets/debt-markets/fixed-rate-mortgages-make-rbnz-s-rates-task-easier-20230220-p5clt7\" target=\"_blank\" rel=\"follow\">mortgage cliff’</a> is on the way for many homeowners. This means a dramatic increase to their monthly expenses, and will potentially put some mortgage owners in the precarious position of having negative equity, which occurs when the level of debt is higher than the value of the property that they own.</p><p class=\"MsoNormal\">For many, it's difficult to imagine how the housing market will rebound in the coming 12 months to 2 years, with recession still looming, and interest rates set to hit their peak at around 5.25% or more by the middle of this year before plateauing. However, one thing is for certain that the arduous process of returning to 2% inflation will come at the cost of a great many New Zealanders losing the ability to afford to pay for their homes.</p><p class=\"MsoNormal\">Severe storms could cause inflation to linger </p><p class=\"MsoNormal\">Eleven people have died as a result of the devastating impact of Cyclone Gabrielle, with many more still unaccounted for more than a week after the storm has passed.</p><p class=\"MsoNormal\">On February 12th, the cyclone made landfall in the northernmost part of the North Island and continued its destructive path along the island's eastern coast. </p><p class=\"MsoNormal\">New Zealand's new Prime Minister Chris Hipkins has <a href=\"https://www.bbc.com/news/world-asia-64674195\" target=\"_blank\" rel=\"follow\">declared</a> Gabrielle the worst natural catastrophe the country has experienced this century.</p><p class=\"MsoNormal\">The RBNZ highlighted in its statement that the storms had caused serious damage and interruption across a wide range of sectors, including manufacturing, transportation, and communications. </p><p class=\"MsoNormal\">Because of this, there may be shortages of certain products and services in the near future, and as a consequence, there will likely be continued high levels of upward pricing pressure, adding further to inflation. It said that activities related to the rebuilding of homes and businesses will pick up pace during the next several years.</p><p class=\"MsoNormal\">The information provided does not constitute investment research. The material has not been prepared in accordance with the legal requirements designed to promote the independence of investment research and as such is to be considered to be a marketing communication.</p><p class=\"MsoNormal\">All information has been prepared by ActivTrades (“AT”). The information does not contain a record of AT’s prices, or an offer of or solicitation for a transaction in any financial instrument. </p><p class=\"MsoNormal\">No representation or warranty is given as to the accuracy or completeness of this information.</p><p class=\"MsoNormal\">Any material provided does not have regard to the specific investment objective and financial situation of any person who may receive it. </p><p class=\"MsoNormal\">Past performance is not a reliable indicator of future performance. AT provides an execution-only service. Consequently, any person acting on the information provided does so at their own risk.</p> This article was written by Finance Magnates Staff at www.financemagnates.com.","content":"The Reserve Bank of New Zealand, at its Monetary Policy Meeting held today, 22nd February, has voted to increase its Official Cash Rate by 50 basis points to 4.75%. This latest increase marks the tenth consecutive rate hike since August 2021, for a whopping total bump of 450 basis points to try and get inflation back in line with the target around 2%. Daily Chart NZD/USD from the ActivTrades online trading platform, showing that the pair is losing bullish momentum as the USD is strengthening. The NZD/USD might be about to validate a double top on its daily chart, leading to potentially more losses. It's been a choppy start to the year for the island nation, as new Prime Minister, Chris Hipkins was sworn in late last month after Jacinta Ardern chose to resign from her position after nearly two terms. The RBNZ in its also made mention of the devastating cyclone that claimed at least 11 lives and has caused billions of dollars worth of damage in recent weeks. There's an outside hope that the end of increasing rate hikes may come soon for struggling Kiwis though, as key financial and economic data is beginning to show small signs of the cooling inflation that the central bank has fought tooth and nail to achieve. Inflation is still holding strong, but has it peaked? In the 12 months leading up to December last year, inflation rose again by 7.2% according to the latest CPI data released by . This rise followed an annual increase of 7.2% in the third quarter, and 7.3% in the quarter before, prompting some economists to forecast that inflation has only room to fall from here. The largest drivers of inflation in the last measured quarter were housing and household utility costs, with the increasing price of food following shortly after. Extreme tightness in the labor market also persists, according to the RBNZ, with employment much above its sustainable level. In the three months ending in December last year, the unemployment rate was still 3.4%, and accelerating wage rises due to worker shortages has helped sustain family earnings, but also contributed to domestic inflation by pushing expenses higher. Many households are still yet to feel the full impact of rate rises in this tightening cycle so far, as their mortgages have been on short-term fixed low rates. This year, a large number of these homeowners will come to the end of their fixed term contracts, and this likely will quickly grind their cash reserves and spending to a halt. Demand will fall shortly thereafter and if the strategy of the RBNZ is successful, inflation should dramatically follow suit in the second half of this year. inflation has already reached its peak, and is gradually declining both internationally and domestically. By as early as the end of this year, they predict inflation will have reduced close to that of the RBNZ's 1%-3% target range again. Housing prices plummeting as mortgages begin to shift to higher borrowing rates New Zealand's housing market crash is getting more dramatic, according to the Real Estate Institute of New Zealand's (REINZ) . The Index, which accounts for variations in the composition of homes sold from month to month rather than relying on title changes based on sales that may have taken place many months earlier, fell by 0.2% in January, bringing the year-over-year loss to 13.9%. The number of houses available for sale has risen by 60% or more in more than half of New Zealand's fourteen regions in the last year, which is despite the fact that there has been a decline in new listings of 16% over the same period. Demand has now well and truly taken a dive in the very recently booming property sector of the economy. Many new homeowners who bought while the OCR was at historic lows of 0.25% in 2020 and 2021, will soon be having their home loans shift from their low fixed rate to the much higher variable one, which could see them go from 2 or 3% to up to 7% borrowing rates. It's a similar story to Australia, whereby a ‘ is on the way for many homeowners. This means a dramatic increase to their monthly expenses, and will potentially put some mortgage owners in the precarious position of having negative equity, which occurs when the level of debt is higher than the value of the property that they own. For many, it's difficult to imagine how the housing market will rebound in the coming 12 months to 2 years, with recession still looming, and interest rates set to hit their peak at around 5.25% or more by the middle of this year before plateauing. However, one thing is for certain that the arduous process of returning to 2% inflation will come at the cost of a great many New Zealanders losing the ability to afford to pay for their homes. Severe storms could cause inflation to linger Eleven people have died as a result of the devastating impact of Cyclone Gabrielle, with many more still unaccounted for more than a week after the storm has passed. On February 12th, the cyclone made landfall in the northernmost part of the North Island and continued its destructive path along the island's eastern coast. New Zealand's new Prime Minister Chris Hipkins has Gabrielle the worst natural catastrophe the country has experienced this century. The RBNZ highlighted in its statement that the storms had caused serious damage and interruption across a wide range of sectors, including manufacturing, transportation, and communications. Because of this, there may be shortages of certain products and services in the near future, and as a consequence, there will likely be continued high levels of upward pricing pressure, adding further to inflation. It said that activities related to the rebuilding of homes and businesses will pick up pace during the next several years. The information provided does not constitute investment research. The material has not been prepared in accordance with the legal requirements designed to promote the independence of investment research and as such is to be considered to be a marketing communication. All information has been prepared by ActivTrades (“AT”). The information does not contain a record of AT’s prices, or an offer of or solicitation for a transaction in any financial instrument. No representation or warranty is given as to the accuracy or completeness of this information. Any material provided does not have regard to the specific investment objective and financial situation of any person who may receive it. Past performance is not a reliable indicator of future performance. AT provides an execution-only service. Consequently, any person acting on the information provided does so at their own risk.","pubDate":"2023-02-22 10:44:47","image_url":null,"source_id":"financemagnates","category":["top"],"country":["united states of america"],"language":"english"},{"title":"Smart Food Packaging Market Size and Regional Forecast [2023-2032] | Industry Share, Growth, and Future Demand","link":"https://www.globenewswire.com/news-release/2023/02/22/2612903/0/en/Smart-Food-Packaging-Market-Size-and-Regional-Forecast-2023-2032-Industry-Share-Growth-and-Future-Demand.html","keywords":["Smart Food Packaging Market","Smart Food Packaging","Smart Food Packaging Industry"],"creator":["Fortune Business Insights"],"video_url":null,"description":"Companies covered in Smart Food Packaging Market are Crown Holdings, Inc., Constar International Inc., Ball Corporation, Bemis Company, Inc., Sysco Corporation, Filtration Group Corporation, Graham Packaging Company, Insignia Technologies Companies covered in Smart Food Packaging Market are Crown Holdings, Inc., Constar International Inc., Ball Corporation, Bemis Company, Inc., Sysco Corporation, Filtration Group Corporation, Graham Packaging Company, Insignia Technologies","content":null,"pubDate":"2023-02-22 10:04:00","image_url":null,"source_id":"globenewswire","category":["business"],"country":["united states of america"],"language":"english"},{"title":"Why China, Russia’s Biggest Backer, Now Says It’s Hoping to Broker Peace in Ukraine","link":"https://time.com/6257398/china-russia-ukraine-war-peace-talks/","keywords":["Uncategorized","China","conflict","diplomacy","russia","Ukraine","world team"],"creator":["Charlie Campbell / Singapore"],"video_url":null,"description":"China’s sudden truce initiative is a bold gambit that raises many questions.","content":"I t may have taken almost a year of bloodshed, but today China sees the war in Ukraine as a big problem—and wants to play a significant role in bringing it to a close. That was the message that Beijing’s top diplomat, Wang Yi, delivered to European leaders at the Munich Security Conference on Saturday. “This warfare must not continue,” he said. The trouble is, of course, that Wang wasn’t suggesting taking the shortest distance between two points, which would be Beijing halting its financial and political support for Vladimir Putin’s war machine. Instead, he ventured a nebulous peace plan that China would broker between the warring parties, while aiming a gossamer-veiled rebuke at the U.S. “Some forces might not want to see peace talks materialize,” Wang said. “They don’t care about the life and death of Ukrainians, nor the harm on Europe. They might have strategic goals larger than Ukraine itself.” Wang Yi, director of China's Central Foreign Affairs Commission, speaks at the Munich Security Conference, Saturday, Feb. 18, 2023. Petr David Josek—AP Point-scoring aside, China’s peace initiative is a bold gambit that raises many questions. Firstly, why now? China has historically been chary about meddling in faraway conflicts. And its forays in Korea in the 1950s and Vietnam in the 1970s came at a high cost. Engaging in the Ukraine conflict now may merely stem from a desire to stay relevant. “It could be just as simple as not wanting to be left out, saying, ‘Hey, we’re involved, we’re big boys, too,’” says Robert Hunter, a former U.S. Ambassador to NATO. “But we won’t know more until they put some meat on the bones.” Of course, there could be another driver: the fact that Russia is losing . From China’s perspective, a swift Putin victory would have been a slap in the face for the U.S. while underscoring the impotence of the West. But the protracted conflict has galvanized the E.U. and reenergized NATO . The longer the fighting rumbles on, the greater chance there is that Russia will be unable to hold its seized territory, portending a waning sphere of influence across Central Asia. “A political vacuum along China’s northern border would be a very grave security threat” for Beijing, says Victor Shih, an expert in Chinese politics at the University of California, San Diego. But a bigger query hangs over whether China has the diplomatic chops to deliver a resolution palatable to both sides. True, over the last 20 years China has upped its contributions to international humanitarian efforts and today is the largest contributor to U.N. peacekeepers amongst Security Council members. But Beijing has precious little experience brokering peace deals, and its motives as Russia’s main strategic partner—one which has benefited from the war through access to cut-price Russian natural resources —are extremely suspect. “China is not a neutral peace broker,” says Jonathan Sullivan, director of China programs at the Asia Research Institute of U.K.’s Nottingham University. “It does not appear to have the credentials to pull this off.” Although Ukrainian Foreign Minister Dmytro Kuleba cautiously welcomed Wang’s plan, President Volodymyr Zelensky has repeatedly ruled out a settlement that gives up any territory, rendering it unclear what any compromise might look like. Victor Gao, director of the China National Association of International Studies and an informal Chinese government spokesman, says that a likely starting point would be an armistice along current battlelines. It would mean “shelving the disputes for future generations to resolve,” says Gao. “And meanwhile, Ukraine will devote itself to peace and development and growth.” As for Russia, China certainly has considerable influence it can wield. As Western countries have severed connections with Moscow, China’s trade with Russia hit a record high level of $190 billion in 2022—a 30% year-on-year rise. China’s purchases of Liquid Petroleum Gas, alone, have doubled over the past year. Wang arrived in Moscow on Tuesday and it remains to be seen how his peace initiative is received by Putin, or how much pressure China is prepared to exert to make it a success. Russia and China flags at a meeting of Russian Security Council Secretary Nikolai Patrushev with Chinese Central Foreign Affairs Commission Director Wang Yi, in Moscow, Feb. 21, 2023. Vitaliy Belousov—Sputnik/AP Certainly, Western skepticism is palpable. “We need more proof that China isn’t working with Russia, and we aren’t seeing that now,” European Commission President Ursula Von der Leyen told CNN on Saturday. U.S. Secretary of State Antony Blinken, meanwhile, hit back that China might be preparing to provide weapons to Russia, warning of “serious consequences” if it did. For sure, a major sticking point looks like China’s incompatible position with Western perspectives: refusing to condemn Putin’s invasion and parroting Russian justifications about threats to its sovereignty. “This war is not just between Russia and Ukraine,” says Gao. “It is, in essence, a war between Russia on the one hand, and the United States and NATO, using Ukraine as a proxy.” Of course, another motivation for Beijing may be to drive a wedge between Kyiv and its Western allies. As the war drags on, how to keep funding Ukraine’s fight will become an increasingly divisive issue for the U.S. and Europe. Wang’s peacebuilding rhetoric also provides a potential smokescreen for Chinese support for Russia—and room for Beijing to recast itself as the “responsible stakeholder” as the U.S ramps up supplies of weaponry. On Tuesday, China’s Foreign Minister Qin Gang urged “relevant countries to immediately stop adding fuel to the fire.” The context of Qin’s remarks are also notable. The former Chinese Ambassador to the U.S. was speaking at the unveiling of a concept paper on Beijing’s plans for a new global security initiative, which, it says, would resolve disputes through dialogue and consultation and “advocate a concept of common security, respecting and safeguarding the security of every country.” Tellingly, the paper explicitly rejected the use of sanctions and backed the participation of multilateral institutions over which Beijing has considerable influence—such as ASEAN, the Africa Union, and the Arab League—while snubbing the E.U. and NATO. It demonstrates that Beijing’s audience is increasingly the so-called Global South, which—while by no means a monolith—has recently surprised Western ears with its tepid backing of Ukraine’s position. A 15-country survey by the European Council on Foreign Relations think tank published Wednesday revealed a widening gulf in attitudes to the war, democracy and the global balance of power between the West and the developing world. “I am struck by how we have lost the trust of the Global South,” French President Emmanuel Macron told the Munich conference. By focusing on “peace and dialogue,” fuzzy as it may sound, China can take the moral high ground over the U.S. in its engagement with the developing world. And by shifting the narrative from war-backer to peace-broker, Beijing scores a victory of influence whether or not its truce proposal ever gets off the ground. “China’s peace talk idea might be rejected out of hand by the West,” says Sullivan. “But it is sure to resonate in the developing world, much of which is suffering due to indirect fallout from the war in terms of their own food and energy security.” More Must-Reads From TIME Putin Suspended the Last Remaining Nuclear Pact With the U.S. Here's What Happens Now Exclusive: Inside a Controversial Startup's Risky Attempt to Control Our Climate No More Mr. Nice Boss: Flexible Employers Were a Pandemic Blip How COVID-19 Changes the Heart The AI Arms Race Is Changing Everything An Entire Ukrainian Village Spent a Harrowing Month in Captivity in a School Basement Michelle Yeoh Has Always Been Criminally Underrated Why Rock Climbing Is Such a Good Workout The Parent Files: New York Governor Kathy Hochul on Being a 'Good Enough' Mom Credit Card Debt Just Hit An All-Time High. Here’s How You Can Pay It Down Write to Charlie Campbell at charlie.campbell@time.com .","pubDate":"2023-02-22 10:00:49","image_url":null,"source_id":"timenextadvisor","category":["top"],"country":["united states of america"],"language":"english"},{"title":"Thermoform Packaging Market Expected to Surpass USD 48.98 billion by 2029 at 3.18% CAGR - Report by Exactitude Consultancy","link":"https://www.globenewswire.com/news-release/2023/02/22/2612889/0/en/Thermoform-Packaging-Market-Expected-to-Surpass-USD-48-98-billion-by-2029-at-3-18-CAGR-Report-by-Exactitude-Consultancy.html","keywords":["Thermoform Packaging Market","Thermoform Packaging Size","Thermoform Packaging Share","Thermoform Packaging Trends"],"creator":["Exactitude Consultancy"],"video_url":null,"description":"Thermoform Packaging Market by Type (Blister, Clamshell, Skin) Seal Coating (Water-based heat, Solvent-based heat, Hot-melt-based heat) End-Use (Food & Beverage, Pharmaceuticals, Electronics, Home & personal care) Region (North America, Asia Pacific, Europe, South America, Middle East & Africa), Global Trends and Forecast from 2023 To 2029 Thermoform Packaging Market by Type (Blister, Clamshell, Skin) Seal Coating (Water-based heat, Solvent-based heat, Hot-melt-based heat) End-Use (Food & Beverage, Pharmaceuticals, Electronics, Home & personal care) Region (North America, Asia Pacific, Europe, South America, Middle East & Africa), Global Trends and Forecast from 2023 To 2029","content":null,"pubDate":"2023-02-22 09:26:00","image_url":null,"source_id":"globenewswire","category":["business"],"country":["united states of america"],"language":"english"},{"title":"How to create NFTs on the Cardano blockchain","link":"https://cointelegraph.com/news/how-to-create-nfts-on-the-cardano-blockchain","keywords":null,"creator":["Cointelegraph By Emi Lacapra"],"video_url":null,"description":"Cardano NFTs are unique digital assets on the Cardano blockchain that can be created using smart contracts and traded on NFT marketplaces.","content":"Cardano is a proof-of-stake (PoS) platform launched in September 2017 by Ethereum co-founder Charles Hoskinson. In September 2021, Cardano added support for smart contracts, which paved the way for developing decentralized finance (DeFi) and nonfungible token (NFT) applications. NFTs landed on Cardano’s blockchain in 2022, with Cardano’s native cryptocurrency ADA ( ADA ) utilized to buy and sell them. The deployment of smart contracts on Cardano allowed the creation of NFT marketplaces , including CNFT.IO and Jpg.store. These marketplaces facilitate NFT projects on Cardano in a cost-effective and scalable way, attracting many enthusiasts seeking a user-friendly platform for creators and traders with low-cost transaction fees. Minting and creating collections are no longer intimidating hurdles for the non-techie NFT enthusiast, as minting on Cardano is similar to doing it on Ethereum or Solana . The platform offers a lot of help with guidelines to take the creators through the process. An original NFT can be anything from a single artwork to a collection of unique items, such as the famous Bored Ape Yacht Club and CryptoPunks collectibles created on the Ethereum blockchain. Once the artwork is produced, it is then minted into an NFT. The next steps are finding the right platform to mint the NFT and the proper marketplace to sell it. Here’s how to create NFTs on the Cardano blockchain: Cardano wallet enables participants to use the ADA ecosystem by sending, receiving, storing and staking ADA and Cardano fungible and nonfungible tokens. Cardano NFT wallets allow users to access blockchain-based decentralized applications (DApps) like decentralized exchanges (DEXs) , DeFi apps and NFT marketplaces. Before choosing the right wallet, it’s best to investigate its security and reputation to avoid risk. Nami wallet is a browser extension wallet that can be used on browsers such as Brave, Google Chrome and Microsoft Edge. Its straightforward interface makes it a user-friendly wallet to manage all Cardano tokens, including Cardano NFTs, and create multiple accounts without many problems. The wallet can connect to all Cardano DApps and NFT marketplaces and is compatible with major hardware wallets like Trezor and Ledger. Users can stake ADA with the Nami wallet, but they can only delegate the cryptocurrency to one developer’s stake pool, the Berry Pool. Daedalus is an open-source cryptocurrency desktop wallet developed by blockchain infrastructure research and engineering company IOG (formerly IOHK ). It is considered a highly secure wallet compatible with Windows, Mac and Linux, with straightforward backup and recovery features. Users can manage all Cardano blockchain tokens, including native assets and Cardano NFTs. Unlike the Nami wallet, Daedalus allows users to stake and delegate their ADA to multiple pools. It is compatible with all the major hardware wallets, including Ledger and Trezor. Flint Wallet is a Cardano native browser extension wallet. Like most Cardano NFT wallets, users can connect to Cardano DApps like Cardano DEXs and Cardano NFT marketplaces. It is also compatible with Ledger, Trezor and most popular hardware wallets. There are several ways and places to buy Cardano NFTs. Users can trade NFTs on specific Cardano NFT marketplaces, but they can also mint them during NFT collection launches and drops or receive them as rewards. All that is needed to buy and sell Cardano NFTs is a native wallet compatible with ADA NFT marketplaces and websites. Minting cryptocurrency nowadays provides straightforward tools to facilitate the process. Minting simply means creating the NFT by turning an image or a music file into a nonfungible token on the Cardano blockchain. Users should be aware of the policyID that every Cardano NFT collection item must display to verify its identity and authenticity. This safeguards people from malicious activities and scams that populate the crypto space. As Cardano is a fast-growing platform for creating and trading NFTs, new marketplaces emerge regularly. Here are some popular and longstanding platforms to buy and sell Cardano NFTs. Jpg.store is a user-friendly, smart contract-enabled NFT marketplace that allows users to create, buy and sell NFTs. It’s a simple marketplace to use, where buyers can access a list of top collections and select the NFT based on price and unique properties. Jpg.store also provides royalties for creators and rarity charts for every asset page. Cardahub is a major Cardano NFT marketplace where users can buy, sell and mint NFTs. The marketplace provides a vast range of NFT tools for creators, digital asset collectors and investors. It’s also home to top collections like the Clay Nation, which includes over 10,000 NFTs. As more than a marketplace, Cardano Cube is an NFT infrastructure aggregator with a list of over 1,000 Cardano-based decentralized applications (DApps) and projects. Cardano Cube is a user’s go-to informative platform for everything related to the Cardano ecosystem. CNFT was the first Cardano NFT marketplace, founded in July 2021. Since its inception, the marketplace has launched thousands of unique NFTs and hundreds of Cardano NFT art and music projects, putting it in direct competition with other mainstream NFT marketplaces such as OpenSea and Foundation. CNFT supports Cardano NFT wallets such as Nami, Gero Wallet, Eternl and Flint Wallet, and provides interesting helping tools like the CNFT Calendar, the first event calendar for the Cardano NFT industry, covering NFT drops and events. The CNFT Jungle is the most extensive automated Cardano NFT rarity database and CNFT market analytics platform. Like Cardano Cube, CNFT Jungle is a market aggregator that lists Cardano projects; however, CNFT Jungle prioritizes rarity. Once the NFT has been created and minted, the trader must sign up with the CNFT marketplace to start navigating the platform. Here’s how to buy and sell NFTs on CNFT: Once you have linked your Cardano-NFT-supported wallet to the marketplace, you’re ready to buy and sell NFTs. The number of NFT projects on Cardano has steadily increased in the last few months. Despite the harsh competition, Cardano saw significant trade volume and demand for its NFTs and metaverse projects, with its popularity as an NFT platform constantly rising. SpaceBudz was launched in March of 2021 on the Cardano blockchain and quickly grew to become one of the most popular projects within the community. The project had a pioneering role in the Cardano NFT community as one of the first Cardano NFT collections, a set of 10,000 collectibles representing cute astronaut animals, among other items. It developed the NFT metadata standard and launched the first fully smart contract-based marketplace. Users can bid, buy or sell one of the 10,000 animals and creatures — some rarer than others — that form the collection to participate in this Cardano open-source project. Pavia is a decentralized gaming NFT metaverse project aimed at collecting pieces of land to build sustainable spaces for the community. The project is named after the city where the Italian mathematician Gerolamo Cardano was born in the 16th century. The Cardano platform took its name from the Italian Renaissance polymath. Yummi Universe is an ecosystem of NFT creatures, cards and other artwork collectibles. The rarity traits in the NFTs are the background, the headwear, the body and the face. Yummi Universe offers a collaboration with a United Kingdom merchandise brand based on the fictional character Naru Naru and its food-loving adventures. The idea is to bring creature collections like Pokémon, Digimon and Moshi Monsters to the blockchain . 2023 is viewed by many as a year of recovery for crypto. The NFT, DeFi and metaverse industries appear to be attracting new media attention, enthusiasts and investors as the space recovers from the aftermath of FTX, Celsius and other big collapses in 2022. Despite the bear market and negative crypto news, the Cardano NFT Ecosystem has become one of the most promising projects to watch out for in the next few years, with an increasing number of new users expected throughout 2023 and beyond. Ethereum’s high gas prices and Solana’s issues around its relationship with FTX and Alameda — among the largest investors in Solana during its 2021 funding round — may all play in favor of Cardano’s continuing expansion, especially as its approach toward scalability and interoperability is producing noticeable results.","pubDate":"2023-02-22 08:50:00","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80YmJmODlhZjE4YzQ2NDdhYjY0Zjc2MjEyMDFkODc1My5qcGc=.jpg","source_id":"cointelegraph","category":["business","top"],"country":["united states of america"],"language":"english"}],"nextPage":"1677055800105b64dd807ed6240a8a74a2e9a9d37d"}
